In [13]:
import pandas as pd
#import numpy as np
#import matplotlib.pyplot as plt
#import seaborn as sns
#from sklearn.preprocessing import StandardScaler
#from sklearn.model_selection import train_test_split

### loading the data

In [4]:
book_tags=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\book_tags.csv')
books=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\books.csv')
ratings=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\ratings.csv')
toread=pd.read_csv(r'C:\Users\vvagh\OneDrive - Indian Institute of Science Education and Research Bhopal\Documents\IITM Stuff\programming\project work\project 2\project data\toread.csv')

### checking out the data

In [5]:
book_tags

        goodreads_book_id  tag_id  count
0                       2   30574  24549
1                       2    8717   3516
2                       2   11305   3441
3                       2   11557   3423
4                       2    6857   1591
...                   ...     ...    ...
156795           31176886     860     10
156796           31176886   21825     10
156797           31176886   10866      9
156798           31176886   29045      9
156799           31176886   30581      9

[156800 rows x 3 columns]

In [19]:
book_mod=book_tags[['tag_id','count']]

In [10]:
group=book_tags.groupby(['goodreads_book_id','tag_id'])[['count']].count()  #grouping the tags for each book

In [20]:
book_mod

        tag_id  count
0        30574  24549
1         8717   3516
2        11305   3441
3        11557   3423
4         6857   1591
...        ...    ...
156795     860     10
156796   21825     10
156797   10866      9
156798   29045      9
156799   30581      9

[156800 rows x 2 columns]

In [23]:
mod_grp=book_mod.groupby('tag_id')[['count']].sum()  #grouping the tags
mod_grp.sort_values(by='count',ascending=False,inplace=True)  #sorting the tags based on count

In [12]:
group.max()  #maximum number of tags for a book

count    1
dtype: int64

In [14]:
group.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 156800 entries, (np.int64(2), np.int64(609)) to (np.int64(31176886), np.int64(33114))
Data columns (total 1 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   count   156800 non-null  int64
dtypes: int64(1)
memory usage: 1.9 MB

In [15]:
group.describe()

          count
count  156800.0
mean        1.0
std         0.0
min         1.0
25%         1.0
50%         1.0
75%         1.0
max         1.0

In [25]:
ratings

        user_id  book_id  rating
0             4       21       5
1             8     9114       5
2             4      145       2
3             4     1057       3
4             4      596       3
...         ...      ...     ...
852083    49802     7112       3
852084    49802     7583       3
852085    49802     6864       3
852086    49802     8050       3
852087    49802     9128       3

[852088 rows x 3 columns]

In [42]:
books.isna().sum()  #checking for missing values

book_id                        0
goodreads_book_id              0
best_book_id                   0
work_id                        0
books_count                    0
isbn                          83
isbn13                        69
authors                        0
original_publication_year      6
original_title                76
title                          0
language_code                175
average_rating                 0
ratings_count                  0
work_ratings_count             0
work_text_reviews_count        0
ratings_1                      0
ratings_2                      0
ratings_3                      0
ratings_4                      0
ratings_5                      0
image_url                      0
small_image_url                0
dtype: int64

In [44]:
books=books[['book_id','work_id','authors','title','books_count','average_rating','ratings_count','work_ratings_count','work_text_reviews_count','ratings_1','ratings_2','ratings_3','ratings_4','ratings_5']]

# Q5: Which (tag_id) is the most frequently used ie. mapped with the highest number of books [book_tags.csv] ? (In case of more than one tag, mention the tag id with the least numerical value) (N)

In [24]:
mod_grp  #maximum number of books for a tag

           count
tag_id
30574   16703129
8717      942720
11557     646056
33114     538700
11305     489205
...          ...
10541          1
10643          1
121            1
117            1
109            1

[9938 rows x 1 columns]

# Q3: How many unique users are present in the dataset [ratings.csv] ? (N)

directly opened the dataset in data wrangler

# Q8: Which is the least used tag, i.e. mapped with the lowest number of books [book_tags.csv]? (In case of more than one tag, mention the tag id with the least numerical value) (N)

In [40]:
mod_grp[mod_grp['count']==mod_grp['count'].min()].index.min()  #minimum tag id with only one book

np.int64(49)

# Q11: How many unique tags are there in the dataset [book_tags.csv] ? (N)

the data is already opened in data wrangler, so just read off the values from there

# Q4: Which book (title) has the maximum number of ratings based on (work_ratings_count) [books.csv] ? (S)